{
  "meta.description": "Control and Telemetry Systems bietet Expertenleistungen in Embedded Systems Design, Hardwareentwicklung und Firmware-Engineering. Wir bauen robuste elektronische Produkte.",
  "meta.title": "Control and Telemetry Systems - Experten für Embedded Systems",
  "header.logo.alt": "Control and Telemetry Systems Logo",
  "header.title": "Control and Telemetry Systems",
  "nav.home": "Home",
  "nav.about": "Über",
  "nav.services": "Services",
  "nav.projects": "Projekte",
  "nav.contact": "Kontakt",
  "header.menu.ariaLabel": "Navigationsmenü umschalten",
  "hero.title": "Building Robust Embedded Systems",
  "hero.subtitle": "Expertise im Design von Embedded Systems, von Konzept über Hardwareentwicklung bis hin zu Firmware-Engineering und Systemintegration. Wir bringen Ihre Produkte auf den Markt.",
  "hero.button": "Services entdecken",
  "about.intro.heading": "Über Control and Telemetry Systems",
  "about.intro.p1": "Spezialisiert auf die Entwicklung elektronischer Produkte mit Schwerpunkt auf Embedded-Mikrocontroller-Systemen, Regelalgorithmen und zuverlässigen IoT-Systemen. Meine Leidenschaft ist die Schaffung intelligenter, vernetzter und effizienter Lösungen.",
  "about.intro.p2": "Mit Erfahrung in Mixed-Signal-Hardware-Design, Echtzeit-Embedded-Software und Testmethoden, um robuste und zuverlässige Produkte für anspruchsvolle Anwendungen in verschiedenen Branchen zu liefern.",
  "about.intro.p3": "Control and Telemetry Systems mit Sitz in der Schweiz nutzt ein Remote-Engineering-Modell. Dies ermöglicht kostenoptimierte Lösungen bei gleichzeitig einfacher Kommunikation und Einhaltung der strengen Qualitätsstandards, die vom Schweizer Ingenieurwesen erwartet werden.",
  "about.intro.button": "Mehr erfahren",
  "services.featured.heading": "Entwicklungsleistungen",
  "services.software.img.alt": "Computer mit Code als Symbol für Embedded-Softwareentwicklung",
  "services.software.title": "Embedded Softwareentwicklung",
  "services.software.desc": "Firmware-Entwicklung für Embedded Systems, von Bare-Metal-Implementierungen bis zu RTOS-Integrationen.",
  "services.software.button": "Mehr erfahren",
  "services.hardware.img.alt": "Nahaufnahme einer komplexen Leiterplatte als Symbol für Hardwareentwicklung",
  "services.hardware.title": "Hardwareentwicklung",
  "services.hardware.desc": "Schaltplanentwurf, PCB-Layout und Hardware-Prototyping für Produkte mit analogen und digitalen Schaltungen.",
  "services.hardware.button": "Mehr erfahren",
  "services.iot.img.alt": "Tablet mit IoT interface als Symbol für IoT-Lösungen",
  "services.iot.title": "ESP32 & Wi-Fi IoT-Lösungen",
  "services.iot.desc": "Spezialisiert auf Wi-Fi-verbundene IoT-Produkte mit ESP32, von Geräte-Firmware bis zur Cloud-Integration.",
  "services.iot.button": "Mehr erfahren",
  "projects.featured.heading": "Ausgewählte Projekte",
  "projects.vega.img.alt": "Vega Flight Computer PCB für Raketenbergung",
  "projects.vega.title": "Vega Flight Computer",
  "projects.vega.desc": "Vielseitiger Flugcomputer für Amateurraketen, vollständig Open-Source und konfigurierbar für alle Arten von Raketen.",
  "projects.vega.button": "Projekt ansehen",
  "projects.reefing.img.alt": "Kundenspezifische Leiterplatte zur Steuerung des Fallschirm-Reffsystems",
  "projects.reefing.title": "Fallschirm-Reffsystem",
  "projects.reefing.desc": "Aktives Reffsystem zur Minderung hoher Stossbelastungen bei der Fallschirmentfaltung für grosse Forschungsraketen.",
  "projects.reefing.button": "Projekt ansehen",
  "footer.copyright": "&copy; 2025 Control and Telemetry Systems. Alle Rechte vorbehalten.",
  "footer.contact": "Kontakt: <a href=\"mailto:contact@ljost.com\">contact@ljost.com</a>",
  "about.meta.description": "Erfahren Sie mehr über Luca Jost, den Gründer von Control and Telemetry Systems, und seine Expertise in Embedded Systems, Hardware-Design und Firmware-Engineering.",
  "about.meta.title": "Über Luca Jost - Control and Telemetry Systems",
  "about.founder.heading": "Über mich: Luca Jost",
  "about.founder.img.alt": "Bild von Luca Jost, Gründer von Control and Telemetry Systems",
  "about.founder.p1": "Willkommen! Ich bin Luca Jost, der Gründer von Control and Telemetry Systems. Meine Leidenschaft für Elektronik und Technologie treibt alles an, was ich hier tue.",
  "about.founder.p2": "Meine Ingenieursreise hat mich um die ganze Welt geführt. Nachdem ich wertvolle Erfahrungen bei Sensirion in der Schweiz gesammelt hatte, zog ich nach Neuseeland, um im spannenden Bereich der Weltraumforschung bei Rocket Lab mitzuwirken. Jetzt in Südkorea ansässig, bleiben meine Kernleidenschaften Raumfahrt und Elektronik, und ich liebe die Herausforderung, innovative Lösungen zu entwickeln.",
  "about.founder.p3": "Control and Telemetry Systems begann vor fünf Jahren als Hobbyprojekt, zunächst mit dem Fokus auf den Bau eines vollständig anpassbaren Open-Source-Flugcomputers namens Vega für Amateurraketen, die Höhen bis zu 30 Kilometer erreichen sollen. Seit beginn hat Vega bemerkenswerte Erfolge erzielt.",
  "about.founder.p4": "Bis heute sind Vega-Flugcomputer hunderte Male erfolgreich geflogen und wurden an Leute weltweit geliefert. Insbesondere wurde Vega seit 2023 als offizielles Tracking- und Logging-System für die grösste Raketen-Challenge Europas (EuRoC) ausgewählt.",
  "about.founder.p5": "EuRoC, das jährlich in Portugal stattfindet, bringt 25 Studententeams aus ganz Europa zusammen, um gegeneinander anzutreten. Jede bei EuRoC gestartete Rakete ist mit einem Vega-Flugcomputer ausgestattet, der eine standardisierte Apogeemessung und zuverlässige Raketenverfolgung gewährleistet.",
  "about.expertise.heading": "Kernkompetenzen",
  "about.expertise.intro": "Meine Expertise umfasst den gesamten Lebenszyklus der Entwicklung von Embedded Systems:",
  "about.expertise.li1": "<strong>Hardware-Design:</strong> Ich bin versiert im Entwurf komplexer Mixed-Signal-Leiterplatten mit Tools wie Altium Designer. Meine Erfahrung umfasst Mikrocontroller, Sensoren, Analog, RF-Kommunikation, Power-Management und Hochleistungsschaltungen.",
  "about.expertise.li2": "<strong>Firmware-Engineering:</strong> Ich entwickle robuste und effiziente Firmware in C/C++ für Bare-Metal- und RTOS-Umgebungen. Meine Expertise umfasst Low-Level-Treiber (I2C, SPI, UART, CAN, LIN), Regelalgorithmen, Sensorfusion (Kalman-Filter) und die Einhaltung von Standards wie MISRA/AUTOSAR.",
  "about.expertise.li3": "<strong>System Engineering:</strong> Erfahren in Anforderungsmanagement, Systemarchitektur, Test und Validierung, insbesondere im Luft- und Raumfahrt- sowie im Automobilsektor.",
  "about.expertise.li4": "<strong>Prototyping & Fertigung:</strong> Fähig, den Übergang vom Design zur Produktion zu managen, einschliesslich Komponentensourcing und Koordination von Kleinserienfertigung.",
  "about.experience.heading": "Highlights der Branchenerfahrung",
  "about.experience.intro": "Ich hatte die Gelegenheit, Projekte in verschiedenen anspruchsvollen Branchen zu leiten und mitzuwirken:",
  "about.experience.li1": "<strong>Luft- und Raumfahrt (Rocket Lab):</strong> Ich trug die Hauptverantwortung als Technical Lead für das Electrical Power System (EPS) und war für dessen Design auf der Neutron Rakete von Rocket Lab verantwortlich. Eine Trägerrakete, die 13 Tonnen in den Orbit befördern kann.",
  "about.experience.li2": "<strong>Automobil & Industrie (Sensirion):</strong> Ich entwickelte Hardware und Firmware für Automobilsensoren (LIN, Cortex-M0+) unter Einhaltung der MISRA/AUTOSAR-Standards und trug zu CI/CD-Prozessen bei.",
  "about.experience.li3": "<strong>Beratung & Produktdesign (Control and Telemetry Systems GmbH):</strong> Ich habe dieses Unternehmen mit Sitz in der Schweiz mitgegründet. Hier spezialisiere ich mich auf das Design von Hardware und Firmware für diverse Anwendungen und manage Kleinserienproduktion.",
  "about.experience.li4": "<strong>Forschung & Entwicklung (IWK HSR):</strong> Ich entwarf Flugcomputer-Hardware und -Firmware für Fixed Wing UAVs, einschliesslich PID-Stabilisierung und Bildverarbeitungsalgorithmen (OpenCV/Python).",
  "about.skills.heading": "Technische Fähigkeiten & Ausbildung",
  "about.skills.li1": "<strong>Wichtige Tools & Technologien:</strong> Altium Designer (Ausgezeichnet), C/C++ (Ausgezeichnet), Python (Fortgeschritten), Git (Ausgezeichnet), NX (Fortgeschritten), RTOS, verschiedene Kommunikationsprotokolle (CAN, LIN, SPI, I2C, UART).",
  "about.skills.li2": "<strong>Ausbildung:</strong> Bachelor of Science in Elektrotechnik (OST, ehemals HSR Rapperswil), Elektroniker EFZ (Technische Fachschule Biel).",
  "about.skills.li3": "<strong>Sprachen:</strong> Fliessend Englisch und Deutsch (Muttersprache).",
  "services.meta.description": "Entdecken Sie die Entwicklungsdienstleistungen für Embedded-Produkte von Control and Telemetry Systems, einschliesslich Firmware-Engineering, Hardware-Design und ESP32/IoT-Lösungen.",
  "services.meta.title": "Control and Telemetry Systems - Leistungen",
  "services.overview.heading": "Entwicklungsdienstleistungen für Embedded-Produkte",
  "services.overview.desc": "Ich biete ein umfassendes Leistungsspektrum, um Ihre Ideen zum Leben zu erwecken, spezialisiert auf Embedded Systems und Mikrocontroller-basierte Lösungen. Als in der Schweiz ansässige GmbH, mit einem Remote-Engineering-Modell, biete ich kosteneffiziente Lösungen ohne Kompromisse.",
  "services.software.heading": "Embedded Softwareentwicklung & Firmware Engineering",
  "services.software.summary": "Expertenentwicklung von Embedded Software und Firmware für Mikrocontroller-basierte Systeme. Ich erstelle robuste, effiziente und zuverlässige Software für Ihre Produkte.",
  "services.software.capabilities.heading": "Embedded Software Fähigkeiten:",
  "services.software.capabilities.li1": "Mikrocontroller-Firmware-Entwicklung (C, C++, Assembly)",
  "services.software.capabilities.li2": "Echtzeitbetriebssystem (RTOS) Integration (z.B. FreeRTOS, Zephyr)",
  "services.software.capabilities.li3": "Gerätetreiberentwicklung",
  "services.software.capabilities.li4": "Bootloader und Systeminitialisierung",
  "services.software.capabilities.li5": "Implementierung von Kommunikationsprotokollen (z.B. SPI, I2C, UART, Ethernet, Bluetooth, Wi-Fi)",
  "services.software.capabilities.li6": "Low-Power-Optimierung für batteriebetriebene Geräte",
  "services.software.capabilities.li7": "Bare-Metal- und RTOS-basierte Entwicklung",
  "services.software.capabilities.li8": "Softwaretests und Validierung",
  "services.hardware.heading": "Mixed-Signal-Hardwareentwicklung",
  "services.hardware.summary": "Komplette Hardware-Design-Dienstleistungen für Produkte mit analogen und digitalen Schaltungen, vom ersten Konzept über die Schaltplanerfassung bis hin zum PCB-Layout und Prototyping.",
  "services.hardware.capabilities.heading": "Hardware-Design Fähigkeiten:",
  "services.hardware.capabilities.li1": "Mixed-Signal-Schaltungsdesign (ADC/DAC, Verstärker, Filter)",
  "services.hardware.capabilities.li2": "Schaltplanerfassung und -design",
  "services.hardware.capabilities.li3": "PCB-Layout und Routing (Multi-Layer, High-Speed)",
  "services.hardware.capabilities.li4": "Komponentenauswahl und Stücklistenverwaltung",
  "services.hardware.capabilities.li5": "Netzteil-Design",
  "services.hardware.capabilities.li6": "Sensorintegration",
  "services.hardware.capabilities.li7": "Integration von drahtlosen Kommunikationsmethoden (Wi-Fi, Bluetooth, LoRa, Mobilfunk)",
  "services.hardware.capabilities.li8": "Design for Manufacturability (DFM) und Design for Testability (DFT)",
  "services.hardware.capabilities.li9": "Hardware-Prototyping und Inbetriebnahme",
  "services.iot.heading": "ESP32 & Wi-Fi IoT-Lösungen",
  "services.iot.summary": "Spezialisiert auf die End-to-End-Entwicklung von Wi-Fi-verbundenen IoT-Produkten, hauptsächlich unter Nutzung der leistungsstarken ESP32-Plattform. Ich verbinde Ihre Geräte mit der Cloud für Monitoring, Steuerung und Dateneinblicke.",
  "services.iot.capabilities.heading": "ESP32/Wi-Fi IoT Fähigkeiten:",
  "services.iot.capabilities.li1": "ESP32 Firmware-Entwicklung (ESP-IDF)",
  "services.iot.capabilities.li2": "Sensorintegration und Datenerfassung",
  "services.iot.capabilities.li3": "Wi-Fi-Netzwerkintegration und Provisionierung",
  "services.iot.capabilities.li4": "MQTT, HTTP, WebSockets Kommunikationsprotokolle",
  "services.iot.capabilities.li5": "Cloud-Plattform-Integration (AWS IoT, Azure IoT Hub, Google Cloud IoT, benutzerdefinierte Backends)",
  "services.iot.capabilities.li6": "Sichere Over-the-Air (OTA) Firmware-Updates",
  "services.iot.capabilities.li7": "Low-Power-Design für batteriebetriebene Geräte",
  "services.iot.capabilities.li8": "Datenverarbeitung und Visualisierung",
  "services.iot.capabilities.li9": "Entwicklung von Begleit-Apps für Mobilgeräte (Steuerung & Überwachung)",
  "projects.meta.description": "Sehen Sie Beispielprojekte von Control and Telemetry Systems, die Expertise in Flugcomputern, Bodenstationen, IoT-Flottenüberwachung und weiteren Embedded-Systems-Lösungen demonstrieren.",
  "projects.meta.title": "Control and Telemetry Systems - Projekte",
  "projects.intro.heading": "Beispielprojekte",
  "projects.intro.desc": "Präsentation unserer Expertise in Embedded Systems, Hardware-Design und Softwareentwicklung anhand verschiedener Projekte.",
  "projects.vega.heading": "Vega Flugcomputer",
  "projects.vega.meta": "Produkt von Control and Telemetry Systems",
  "projects.vega.desc1": "Entwicklung eines vielseitigen Flugcomputers, der den Bedarf an zuverlässiger Hardware für die Raketenbergung deckt. Verfügt über automatische Orientierungserkennung und eine konfigurierbare Finite State Machine, die Flugphasen verwaltet und benutzerdefinierte Ereignisse (Pyro, Servo, GPIO) auslöst.",
  "projects.engineeringHighlights": "Technische Highlights",
  "projects.vega.desc2": "Nutzt einen STM32-Mikrocontroller mit Kalman Filter Sensorfusion für präzises Tracking. Implementiert ein benutzerdefiniertes, robustes 2,4 GHz FHSS Telemetriesystem für sichere Datenübertragung über grosse Entfernungen (30 km+ getestet) mit hoher Datenrate. Enthält Hochleistungsausgänge, konfigurierbare Servosteuerung, umfassende Onboard-Datenlogging und vereinfachte Konfiguration über eine benutzerdefinierte Electron Desktop Anwendung.",
  "projects.groundStation.heading": "Bodenstation",
  "projects.groundStation.meta": "Produkt von Control and Telemetry Systems",
  "projects.groundStation.desc1": "Entwicklung der Begleithardware für den Vega Flugcomputer, die Echtzeitüberwachung, Tracking und Interaktion während Raketenflügen ermöglicht.",
  "projects.groundStation.img.alt": "Benutzerdefinierte Bodenstationshardware mit Display und Bedienelementen",
  "projects.groundStation.desc2": "Verfügt über zwei SX1280 Funkgeräte, die den Empfang von zwei unabhängigen Vega Computer oder Diversity-Tracking eines Computers unterstützen. Enthält ein gut sichtbares transflektives Display, USB-C Ladung, Onboard-Logging und integrierten Kompass/GNSS für verbessertes Tracking. Die Software ermöglicht das ferngesteuerte Auslösen von Ereignissen zum Testen und die sofortige Überprüfung der Daten nach dem Flug über einen integrierten Plotter. Die sichere Kopplung mit Vega wird über eine einfache \"Link-Phrase\" verwaltet.",
  "projects.reefing.heading": "Fallschirm-Reffsystem für Höhenforschungsraketen",
  "projects.reefing.meta": "Zusammenarbeit mit ARIS",
  "projects.reefing.desc1": "Um hohe Stossbelastungen bei der Fallschirmentfaltung bei immer grösseren Forschungsraketen für ARIS zu mindern, wurde ein aktives Reffsystem entwickelt. Dieses System steuert die anfängliche Öffnungsgrösse des Fallschirms und ermöglicht eine sanftere vollständige Entfaltung in einer bestimmten Höhe.",
  "projects.reefing.desc2": "Der Kernmechanismus bestand darin, eine Reffleine präzise mit einem gesteuerten Keramikheizelement zu durchtrennen. Es wurde eine STM32-basierte Hardware entwickelt, um das Heizelement zu steuern, Sensordaten zur Höhenbestimmung (mittels Kalman-Filter) zu verarbeiten und die Telemetriekommunikation zu handhaben. Ein wesentlicher Schwerpunkt lag auf dem Energiemanagement für lange Standby Zeiten in batteriebetriebenen Szenarien.",
  "projects.fleetMonitor.heading": "Fleet Monitoring System",
  "projects.fleetMonitor.meta": "Zusammenarbeit mit Onway AG",
  "projects.fleetMonitor.desc1": "Entwicklung einer IoT-Lösung für die Onway AG zur Echtzeitüberwachung von Fahrzeugflotten des öffentlichen Verkehrs. Das System sammelt Low-Level Fahrzeugdaten direkt vom CAN-Bus und überträgt diese zur Analyse und Fehlererkennung an ein Cloud Backend.",
  "projects.fleetMonitor.img.alt": "ESP32-basiertes IoT-Gerät zur Fahrzeugflottenüberwachung",
  "projects.fleetMonitor.desc2": "Der gebrauch von einem ESP32-S2 SoC ermöglicht direkte die Datenweiterleitung von CAN-Bus über Ethernet oder Wi-Fi. Zusäzliche Daten werden über ein integrierter Beschleunigungsmesser gesammelt um Fahrdynamikdaten zu überwachen. Ein Onboard-Dateisystem für das Konfigurationsmanagement wurde implementiert, das Updates über USB oder Over-the-Air (OTA) unterstützt.",
  "contact.meta.description": "Kontaktieren Sie Control and Telemetry Systems für Anfragen zu Embedded Systems Design, Hardwareentwicklung und Firmware-Engineering Dienstleistungen.",
  "contact.meta.title": "Kontakt - Control and Telemetry Systems",
  "contact.intro.heading": "Kontakt aufnehmen",
  "contact.intro.desc": "Haben Sie ein Projekt im Sinn oder Fragen zu unseren Dienstleistungen? Füllen Sie das untenstehende Formular aus oder senden Sie uns direkt eine E-Mail.",
  "contact.details.heading": "Kontaktinformationen",
  "contact.details.email": "<strong>E-Mail:</strong> <a href=\"mailto:contact@ljost.com\">contact@ljost.com</a>",
  "contact.form.heading": "Kontaktformular",
  "contact.form.nameLabel": "Name:",
  "contact.form.emailLabel": "E-Mail:",
  "contact.form.subjectLabel": "Betreff:",
  "contact.form.messageLabel": "Nachricht:",
  "contact.form.submitButton": "Nachricht senden"
}
