{
  "meta.description": "Control and Telemetry Systems offers expert embedded systems design, hardware development, and firmware engineering services. We build robust electronic products.",
  "meta.title": "Control and Telemetry Systems - Embedded Systems Experts",
  "header.logo.alt": "Control and Telemetry Systems Logo",
  "header.title": "Control and Telemetry Systems",
  "nav.home": "Home",
  "nav.about": "About",
  "nav.services": "Services",
  "nav.projects": "Projects",
  "nav.contact": "Contact",
  "header.menu.ariaLabel": "Toggle navigation menu",
  "hero.title": "Building Robust Embedded Systems",
  "hero.subtitle": "Expertise in embedded systems design, from initial concept and hardware development to firmware engineering and system integration. We bring your complex electronic products to market.",
  "hero.button": "Explore Our Services",
  "about.intro.heading": "About Control and Telemetry Systems",
  "about.intro.p1": "Specializing in the development of sophisticated electronic products with a core focus on embedded microcontroller systems, control algorithms, and reliable IoT systems. I am passionate about creating intelligent, connected, and efficient solutions.",
  "about.intro.p2": "With experience in mixed-signal hardware design, real-time embedded software, and rigorous testing methodologies to deliver robust and dependable products for demanding applications across various industries.",
  "about.intro.p3": "Based in Switzerland, Control and Telemetry Systems leverages a remote engineering model. This allows offering cost-optimized solutions while ensuring seamless communication and upholding the rigorous quality standards expected from Swiss engineering.",
  "about.intro.button": "Learn More",
  "services.featured.heading": "Development Services",
  "services.software.img.alt": "Circuit board with code overlay representing embedded software development",
  "services.software.title": "Embedded Software Development",
  "services.software.desc": "Firmware development for embedded systems, from bare-metal implementations to RTOS integrations.",
  "services.software.button": "Learn More",
  "services.hardware.img.alt": "Close-up of a complex PCB representing hardware development",
  "services.hardware.title": "Hardware Development",
  "services.hardware.desc": "Schematic design, PCB layout, and hardware prototyping for electronic products incorporating both analog and digital circuits.",
  "services.hardware.button": "Learn More",
  "services.iot.img.alt": "ESP32 microcontroller connected to sensors representing IoT solutions",
  "services.iot.title": "ESP32 & Wi-Fi IoT Solutions",
  "services.iot.desc": "Specializing in Wi-Fi connected IoT products using the ESP32 platform, from device firmware to cloud integration.",
  "services.iot.button": "Learn More",
  "projects.featured.heading": "Featured Projects",
  "projects.vega.img.alt": "Vega Flight Computer PCB for rocketry recovery",
  "projects.vega.title": "Vega Flight Computer",
  "projects.vega.desc": "Versatile flight computer for amateur rocketry, fully open-source and configurable for all kinds of rockets.",
  "projects.vega.button": "View Project",
  "projects.reefing.img.alt": "Custom PCB for parachute reefing system control",
  "projects.reefing.title": "Parachute Reefing System",
  "projects.reefing.desc": "Active reefing system to mitigate high shock loads during parachute deployment for large research rockets.",
  "projects.reefing.button": "View Project",
  "footer.copyright": "&copy; 2025 Control and Telemetry Systems. All rights reserved.",
  "footer.contact": "Contact: <a href=\"mailto:contact@ljost.com\">contact@ljost.com</a>",
  "about.meta.description": "Learn about Luca Jost, the founder of Control and Telemetry Systems, and his expertise in embedded systems, hardware design, and firmware engineering.",
  "about.meta.title": "About Luca Jost - Control and Telemetry Systems",
  "about.founder.heading": "About Me: Luca Jost",
  "about.founder.img.alt": "Picture of Luca Jost, founder of Control and Telemetry Systems",
  "about.founder.p1": "Welcome! I'm Luca Jost, the founder of Control and Telemetry Systems. My passion for electronics and technology drives everything I do here. My journey has been one of continuous learning and hands-on project work.",
  "about.founder.p2": "My journey in engineering has taken me across the globe. After gaining valuable experience at Sensirion in Switzerland, I moved to New Zealand to contribute to the exciting field of space exploration at Rocket Lab. Now based in South Korea, my core passions remain space and electronics, and I thrive on the challenge of developing innovative solutions.",
  "about.founder.p3": "Control and Telemetry Systems began as a hobby project five years ago, initially focused on building a fully customizable open-source flight computer, named Vega, for amateur rockets designed to reach altitudes up to 30 kilometers. Since its inception, Vega has achieved remarkable success.",
  "about.founder.p4": "To date, Vega flight computers have flown successfully hundreds of times and have been supplied to people worldwide. Notably, Vega was selected as the official tracking and logging system for the biggest rocketry challenge in Europe (EuRoC) since 2023.",
  "about.founder.p5": "EuRoC, held annually in Portugal, brings together 25 student teams from across Europe to compete. Every rocket launched at EuRoC is equipped with a Vega flight computer, ensuring standardized apogee reporting and reliable rocket tracking. Teams also utilize Vega's capabilities to implement mechanisms like airbrakes for precise altitude control.",
  "about.expertise.heading": "Core Expertise",
  "about.expertise.intro": "My expertise spans the full lifecycle of embedded systems development:",
  "about.expertise.li1": "<strong>Hardware Design:</strong> I'm proficient in designing complex, mixed-signal PCBs for demanding applications using tools like Altium Designer. My experience covers microcontrollers (STM32), sensors, RF communication, power management, and high-power circuitry.",
  "about.expertise.li2": "<strong>Firmware Engineering:</strong> I develop robust and efficient firmware in C/C++ for bare-metal and RTOS environments (like STM32). My expertise includes low-level drivers (I2C, SPI, UART, CAN, LIN), control algorithms, sensor fusion (Kalman filters), and adhering to standards like MISRA/AUTOSAR.",
  "about.expertise.li3": "<strong>System Engineering:</strong> Experienced in requirement engineering, system architecture, testing, and validation, particularly within the aerospace and automotive sectors.",
  "about.expertise.li4": "<strong>Prototyping & Manufacturing:</strong> Capable of managing the transition from design to production, including component sourcing and small-batch manufacturing coordination.",
  "about.experience.heading": "Industry Experience Highlights",
  "about.experience.intro": "I've had the opportunity to contribute to and lead projects across various demanding industries:",
  "about.experience.li1": "<strong>Aerospace (Rocket Lab):</strong> I held the primary responsibility of Technical Lead for the Electrical Power System (EPS), responsible for its design on Rocket Lab's Neutron Launch Vehicle. A medium-lift launch vehicle capable of delivering 13 metric tons to orbit.",
  "about.experience.li2": "<strong>Automotive & Industrial (Sensirion):</strong> I developed hardware and firmware for automotive sensors (LIN, Cortex-M0+), adhering to MISRA/AUTOSAR standards, and contributed to CI/CD processes.",
  "about.experience.li3": "<strong>Consultancy & Product Design (Control and Telemetry Systems GmbH):</strong> I co-founded this company, based in Switzerland. Here, I specialize in designing hardware and firmware for diverse applications (often using RTOS on STM32) and manage small-batch production.",
  "about.experience.li4": "<strong>Research & Development (IWK HSR):</strong> I designed flight computer hardware and firmware for fixed-wing UAVs, including PID stabilization and image processing algorithms (OpenCV/Python).",
  "about.skills.heading": "Technical Skills & Education",
  "about.skills.li1": "<strong>Key Tools & Technologies:</strong> Altium Designer (Excellent), C/C++ (Excellent), Python (Advanced), Git (Excellent), NX (Advanced), RTOS, various communication protocols (CAN, LIN, SPI, I2C, UART).",
  "about.skills.li2": "<strong>Education:</strong> Bachelor of Science in Electrical Engineering (OST, formerly HSR Rapperswil), Electronics Technician (Technische Fachschule Biel).",
  "about.skills.li3": "<strong>Languages:</strong> Fluent in English and German (Mother tongue).",
  "services.meta.description": "Explore the embedded product development services offered by Control and Telemetry Systems, including firmware engineering, hardware design, and ESP32/IoT solutions.",
  "services.meta.title": "Control and Telemetry Systems - Services",
  "services.overview.heading": "Embedded Product Development Services",
  "services.overview.desc": "I offer a comprehensive range of services to bring your electronic product ideas to life, specializing in embedded systems and microcontroller-based solutions. As a Swiss-based consultant utilizing a remote engineering model, I provide cost-effective expertise without compromising on communication or the high standards of quality.",
  "services.software.heading": "Embedded Software Development & Firmware Engineering",
  "services.software.summary": "Expert embedded software and firmware development for microcontroller-based systems. I create robust, efficient, and reliable software for your electronic products.",
  "services.software.capabilities.heading": "Embedded Software Capabilities:",
  "services.software.capabilities.li1": "Microcontroller Firmware Development (C, C++, Assembly)",
  "services.software.capabilities.li2": "Real-Time Operating System (RTOS) Integration (e.g., FreeRTOS, Zephyr)",
  "services.software.capabilities.li3": "Device Driver Development",
  "services.software.capabilities.li4": "Bootloaders and System Initialization",
  "services.software.capabilities.li5": "Communication Protocol Implementation (e.g., SPI, I2C, UART, Ethernet, Bluetooth, Wi-Fi)",
  "services.software.capabilities.li6": "Low-Power Optimization for Battery-Powered Devices",
  "services.software.capabilities.li7": "Bare-metal and RTOS-based Development",
  "services.software.capabilities.li8": "Software Testing and Validation for Embedded Systems",
  "services.hardware.heading": "Mixed Signal Hardware Development",
  "services.hardware.summary": "Complete hardware design services for electronic products incorporating both analog and digital circuits, from initial concept and schematic capture to PCB layout and prototyping.",
  "services.hardware.capabilities.heading": "Hardware Design Capabilities:",
  "services.hardware.capabilities.li1": "Mixed-Signal Circuit Design (ADC/DAC, Amplifiers, Filters)",
  "services.hardware.capabilities.li2": "Schematic Capture and Design",
  "services.hardware.capabilities.li3": "PCB Layout and Routing (Multi-layer, High-speed)",
  "services.hardware.capabilities.li4": "Component Selection and BOM Management",
  "services.hardware.capabilities.li5": "Power Supply Design",
  "services.hardware.capabilities.li6": "Sensor Integration",
  "services.hardware.capabilities.li7": "Wireless Communication Module Integration (Wi-Fi, Bluetooth, LoRa, Cellular)",
  "services.hardware.capabilities.li8": "Design for Manufacturability (DFM) and Design for Testability (DFT)",
  "services.hardware.capabilities.li9": "Hardware Prototyping and Bring-up",
  "services.iot.heading": "ESP32 & Wi-Fi IoT Solutions",
  "services.iot.summary": "Specializing in end-to-end development of Wi-Fi connected IoT products, primarily leveraging the powerful ESP32 platform. I connect your devices to the cloud for monitoring, control, and data insights.",
  "services.iot.capabilities.heading": "ESP32/Wi-Fi IoT Capabilities:",
  "services.iot.capabilities.li1": "ESP32 Firmware Development (ESP-IDF, Arduino Core)",
  "services.iot.capabilities.li2": "Sensor Integration and Data Acquisition",
  "services.iot.capabilities.li3": "Wi-Fi Network Integration and Provisioning",
  "services.iot.capabilities.li4": "MQTT, HTTP, WebSockets Communication Protocols",
  "services.iot.capabilities.li5": "Cloud Platform Integration (AWS IoT, Azure IoT Hub, Google Cloud IoT, Custom Backends)",
  "services.iot.capabilities.li6": "Secure Over-the-Air (OTA) Firmware Updates",
  "services.iot.capabilities.li7": "Low-Power Design for Battery-Operated Wi-Fi Devices",
  "services.iot.capabilities.li8": "Data Processing and Visualization",
  "services.iot.capabilities.li9": "Companion Mobile App Development (Control & Monitoring)",
  "projects.meta.description": "View example projects by Control and Telemetry Systems, showcasing expertise in flight computers, ground stations, IoT fleet monitoring, and more embedded systems solutions.",
  "projects.meta.title": "Control and Telemetry Systems - Projects",
  "projects.intro.heading": "Example Projects",
  "projects.intro.desc": "Showcasing our expertise in embedded systems, hardware design, and software development through various challenging projects.",
  "projects.vega.heading": "Vega Flight Computer",
  "projects.vega.meta": "Control and Telemetry Systems Product",
  "projects.vega.desc1": "Engineered a versatile flight computer addressing the need for reliable rocketry recovery hardware. Features automatic orientation detection and a configurable Finite State Machine managing flight phases and triggering user-defined events (pyro, servo, GPIO).",
  "projects.engineeringHighlights": "Engineering Highlights",
  "projects.vega.desc2": "Leverages an STM32 microcontroller with advanced Kalman Filter sensor fusion for precise tracking. Implements a custom, robust 2.4GHz FHSS telemetry system for secure, long-range (10km+ tested), high-rate (10Hz) data transmission. Includes high-power outputs, configurable servo control, comprehensive onboard data logging, and streamlined configuration via a custom Electron desktop application.",
  "projects.groundStation.heading": "Ground Station",
  "projects.groundStation.meta": "Control and Telemetry Systems Product",
  "projects.groundStation.desc1": "Developed the companion hardware for the Vega flight computer, enabling real-time monitoring, tracking, and interaction during rocket flights.",
  "projects.groundStation.img.alt": "Custom ground station hardware with display and controls",
  "projects.groundStation.desc2": "Features dual SX1280 radios supporting reception from two independent Vega units or diversity tracking of one. Incorporates a high-visibility transflective display, USB-C charging, onboard logging, and integrated compass/GNSS for enhanced tracking. Software enables remote event triggering for testing and immediate post-flight data review via an integrated plotter. Secure pairing with Vega units is managed via a simple \"link phrase\".",
  "projects.reefing.heading": "Parachute Reefing System for Sounding Rockets",
  "projects.reefing.meta": "Collaboration with ARIS",
  "projects.reefing.desc1": "To mitigate high shock loads during parachute deployment on increasingly large research rockets for ARIS, an active reefing system was engineered. This system controls the parachute's initial opening size, allowing for a gentler full deployment at a specific altitude.",
  "projects.reefing.desc2": "The core mechanism involved precisely cutting a reefing line using a controlled ceramic heating element. Custom STM32-based hardware was developed to manage the heating element, process sensor data for altitude determination (using a Kalman Filter), and handle telemetry communication. Significant focus was placed on power management for long standby times in battery-operated scenarios.",
  "projects.fleetMonitor.heading": "Fleet Monitoring System",
  "projects.fleetMonitor.meta": "Collaboration with Onway AG",
  "projects.fleetMonitor.desc1": "Developed an IoT solution for Onway AG to enable real-time monitoring of public transport vehicle fleets. The system gathers low-level vehicle data directly from the CAN bus and transmits it to a cloud backend for analysis and issue detection.",
  "projects.fleetMonitor.img.alt": "ESP32-based IoT device for vehicle fleet monitoring",
  "projects.fleetMonitor.desc2": "Based on an ESP32-S2 SoC, the system features direct CAN bus interfacing, data filtering, and flexible data forwarding via Ethernet or Wi-Fi. An integrated accelerometer provides driving performance metrics. Robustness was enhanced with an onboard file system for configuration management, supporting updates via USB or Over-the-Air (OTA).",
  "contact.meta.description": "Contact Control and Telemetry Systems for inquiries about embedded systems design, hardware development, and firmware engineering services.",
  "contact.meta.title": "Contact - Control and Telemetry Systems",
  "contact.intro.heading": "Get In Touch",
  "contact.intro.desc": "Have a project in mind or questions about our services? Fill out the form below or email us directly.",
  "contact.details.heading": "Contact Information",
  "contact.details.email": "<strong>Email:</strong> <a href=\"mailto:contact@ljost.com\">contact@ljost.com</a>",
  "contact.form.heading": "Contact Form",
  "contact.form.nameLabel": "Name:",
  "contact.form.emailLabel": "Email:",
  "contact.form.subjectLabel": "Subject:",
  "contact.form.messageLabel": "Message:",
  "contact.form.submitButton": "Send Message"
}
